{"config": [{"config": {"strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_17", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 64, 64, 3], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "filters": 32, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_25", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_18", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "filters": 32, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_26", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_9", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_13", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_19", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null, "filters": 64, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_27", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_20", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "filters": 64, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_28", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_10", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_14", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_5", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_9", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_29", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_15", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_10", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_30", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.1.1", "class_name": "Sequential"}