{"class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 64, 64, 3], "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1", "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_2", "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_3", "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_4", "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "units": 512, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "units": 2, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow"}